## Missing Values

In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[2,4,np.nan,6,np.nan],
    'C':[3,6,9,np.nan,np.nan],
    'D':[np.nan,8,12,16,20],
    'E':[np.nan,11,15,np.nan,np.nan],
    'F':[6,12,18,24,30]
    })

In [3]:
df=pd.DataFrame(data)
print(df)

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [4]:
df.isna()

       A      B      C      D      E      F
0  False  False  False   True   True  False
1  False  False  False  False  False  False
2  False   True  False  False  False  False
3  False  False   True  False   True  False
4  False   True   True  False   True  False

In [5]:
df.isna().sum()

A    0
B    2
C    2
D    1
E    3
F    0
dtype: int64

In [6]:
df.isna().any()

A    False
B     True
C     True
D     True
E     True
F    False
dtype: bool

In [7]:
#Delete row with any nan value
df.dropna()
df.dropna(axis=0,how='any') #Both will give same output

   A    B    C    D     E   F
1  2  4.0  6.0  8.0  11.0  12

In [8]:
#Delete row with aall nan value
df.dropna(axis=0,how='all')

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [9]:
#Delete Col with any nan value
df.dropna(axis=1)
df.dropna(axis=1,how='any') #Both will give same output

   A   F
0  1   6
1  2  12
2  3  18
3  4  24
4  5  30

In [10]:
#Delete row with aall nan value
df.dropna(axis=1,how='all')

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [11]:
#Threshold -- At Least
df.dropna(thresh=4) #Atleast 4 Non Nan Calue in row

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24

In [12]:
df.dropna(axis=1,thresh=4) #Atleast 4 Non Nan Calue in column
print(df)

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [13]:
df

   A    B    C     D     E   F
0  1  2.0  3.0   NaN   NaN   6
1  2  4.0  6.0   8.0  11.0  12
2  3  NaN  9.0  12.0  15.0  18
3  4  6.0  NaN  16.0   NaN  24
4  5  NaN  NaN  20.0   NaN  30

In [14]:
#Fill The Missing Value with 0
df.fillna(0)

   A    B    C     D     E   F
0  1  2.0  3.0   0.0   0.0   6
1  2  4.0  6.0   8.0  11.0  12
2  3  0.0  9.0  12.0  15.0  18
3  4  6.0  0.0  16.0   0.0  24
4  5  0.0  0.0  20.0   0.0  30

In [15]:
values={'A':100,'B':200,'C':300,'D':400,'E':500,'F':600}
df.fillna(value=values)

   A      B      C      D      E   F
0  1    2.0    3.0  400.0  500.0   6
1  2    4.0    6.0    8.0   11.0  12
2  3  200.0    9.0   12.0   15.0  18
3  4    6.0  300.0   16.0  500.0  24
4  5  200.0  300.0   20.0  500.0  30

In [16]:
#Fill with mean
df.fillna(df.mean())

   A    B    C     D     E   F
0  1  2.0  3.0  14.0  13.0   6
1  2  4.0  6.0   8.0  11.0  12
2  3  4.0  9.0  12.0  15.0  18
3  4  6.0  6.0  16.0  13.0  24
4  5  4.0  6.0  20.0  13.0  30